////龟藏64卦
//阴为0，阳为1，从上到下计算：a * 32 + b * 16 + c * 8 + d * 4 + e * 2 + f * 1
function GetGuaIndex(a, b, c, d, e, f)
{    
    var index = a * 32 + b * 16 + c * 8 + d * 4 + e * 2 + f;
    return index;
}
//64个卦名
var Gui64GuaMing = new Array(
        "&emsp;地卦&emsp;",     //000 000
        "地神深藏", //000 001
        "地人不出", //000 010
        "地鬼有知", //000 011
        "地魔重生", //000 100
        "地变潜危", //000 101
        "地妖遁形", //000 110
        "地天不顺", //000 111
        ///////////////////////
        "神地铭志", //001 000
        "&emsp;神卦&emsp;",     //001 001
        "神人不知", //001 010
        "神鬼控制", //001 011
        "神魔一家", //001 100
        "神变难分", //001 101
        "神妖难解", //001 110
        "神天合理", //001 111
        ///////////////////////   
        "人地有道", //010 000
        "人神不敬", //010 001
        "&emsp;人卦&emsp;",     //010 010
        "人鬼不测", //010 011
        "人魔戾相", //010 100
        "人变异相", //010 101
        "人妖极端", //010 110
        "人天乱伦", //010 111
        ///////////////////////  
        "鬼地出尘", //011 000
        "鬼神上位", //011 001
        "鬼人腐败", //011 010
        "&emsp;鬼卦&emsp;",     //011 011
        "鬼魔相互", //011 100
        "鬼变顺序", //011 101
        "鬼妖相向", //011 110
        "鬼天葬礼", //011 111
        ///////////////////////
        "魔地横行", //100 000
        "魔神渲染", //100 001
        "魔人大于", //100 010
        "魔鬼生机", //100 011
        "&emsp;魔卦&emsp;",     //100 100
        "魔变通神", //100 101
        "魔妖显著", //100 110
        "魔天逆行", //100 111
        ///////////////////////
        "变地明显", //101 000
        "变神天昏", //101 001
        "变人远昭", //101 010
        "变鬼精华", //101 011
        "变魔地暗", //101 100
        "&emsp;变卦&emsp;",     //101 101
        "变妖空虚", //101 110
        "变天对相", //101 111
        ///////////////////////
        "妖地苦行", //110 000
        "妖神通顺", //110 001
        "妖人恶心", //110 010
        "妖鬼惧行", //110 011
        "妖魔满地", //110 100
        "妖变原始", //110 101
        "&emsp;妖卦&emsp;",     //110 110
        "妖天无礼", //110 111
        ///////////////////////
        "天地无情", //111 000
        "天神济世", //111 001
        "天人合一", //111 010
        "天鬼乱治", //111 011
        "天魔解体", //111 100
        "天变幻生", //111 101
        "天妖遂化", //111 110
        "&emsp;天卦&emsp;"      //111 111
        );
//每个卦的五行，金、水、木、火、土、无
var Gui64WuXing = new Array(
        "水",   //地地
        "水",   //地神
        "水",   //地人
        "土",   //地鬼
        "木",   //地魔
        "水",   //地变
        "水",   //地妖
        "水",   //地天
        ///////////////////////
        "水",   //神地
        "无",   //神神
        "水",   //神人
        "土",   //神鬼
        "木",   //神魔
        "火",   //神变
        "金",   //神妖
        "无",   //神天
        ///////////////////////
        "水",   //人地
        "水",   //人神
        "水",   //人人
        "土",   //人鬼
        "木",   //人魔
        "水",   //人变
        "水",   //人妖
        "水",   //人天
        ///////////////////////  
        "土",   //鬼地
        "土",   //鬼神
        "土",   //鬼人
        "土",   //鬼鬼
        "木",   //鬼魔
        "土",   //鬼变
        "金",   //鬼妖
        "土",   //鬼天
        ///////////////////////
        "木",   //魔地
        "木",   //魔神
        "木",   //魔人
        "木",   //魔鬼
        "木",   //魔魔
        "火",   //魔变
        "金",   //魔妖
        "木",   //魔天
        ///////////////////////
        "水",   //变地
        "火",   //变神
        "水",   //变人
        "土",   //变鬼
        "火",   //变魔
        "火",   //变变
        "火",   //变妖
        "火",   //变天
        ///////////////////////
        "水",   //妖地
        "金",   //妖神
        "水",   //妖人
        "金",   //妖鬼
        "金",   //妖魔
        "火",   //妖变
        "金",   //妖妖
        "金",   //妖天
        ///////////////////////
        "水",   //天地
        "无",   //天神
        "水",   //天人
        "土",   //天鬼
        "木",   //天魔
        "火",   //天变
        "金",   //天妖
        "无"    //天天
        );
//每个卦的描述
var Gui64MiaoShu = new Array(
        "地卦：为水，生命之源自水中来，代表万物生机。生灵居所皆为地，三玄世界之理为地之相，如若地相破坏，则生机破坏，一切不复存在。",
        "地神深藏：深藏不露之相。以行军为例，我军虽强但不能立即取胜，但敌会变化。建议深藏实力，待机成熟，一举灭之。",
        "地人不出：龟缩不出，受困之相。行军占得此卦，说明敌方太强大，不能正面与战，应该龟缩在有利地形坚守，等待时机。",
        "地鬼有知：敌在明，我在暗，虽然知道了对方情况，但是没有实际行动。",
        "地魔重生：地难困我，我欲成魔重出，重生之相。事业占得重生，大吉之相。故，重生代表着一种突破力量。",
        "地变潜危：暗藏危机，危险来临之相。要快速逃跑，否则危险。",
        "地妖遁形：动物在地下活动，迟早要出来。东窗事发之相，纸包不住火。",
        "地天不顺：行事顺序不对，事情的先后主次没理清。行事占得地天不顺，不可直行，需要调整事情顺序。",
        ///////////////////////
        "神地铭志：神在地上渡化众人，给人希望明夷之相。凡事占得此卦，都会顺利执行。",
        "神卦：神性高高在上，魔性在底下，升华之相。五行是空，神为人升。济世救人的心就是神性，累积善心善行，人的神性不断提升，最后修成神。",
        "神人不知：神在人上，人却不知道神的情况，无知之相。占得此卦时，容易因为不知道事情的真相内幕而失利。",
        "神鬼控制：鬼在神之下，神控制鬼的行动，被动受制之相。占得此卦时，我方处于被动挨打局面，无法掌控局势。",
        "神魔一家：魔不生神，神不生魔，不克不合，却为一家，万千之道皆为自然。得失皆有，中等平顺之相。",
        "神变难分：神的变化人永远分辨不了，故叫难分。行军占得难分，敌情变化中必有高人在，建议收买或除掉敌方谋士。",
        "神妖难解：神道解不了妖道，妖更不知自己的道。难以理解，不能合作之相，永远不知道对方在想啥。",
        "神天合理：神在天上,神与天合起来治理。合理之相，即合同治理，合作愉快的意思。",
        ///////////////////////
        "人地有道：人在地上，有路可走，故为有道也，是为道行无阻之相。凡事占得有道，事情畅通无阻，顺利执行。",
        "人神不敬：人原本不该在神上，而出现人在神上，是大不敬之相。处事方法不对，容易得罪上层。",
        "人卦：人自水中出，水中化形而实，变成人，代表生机变化。有思想有善心的皆为人，失去善心的则连野兽都不如，修行修的就是善心善行。",
        "人鬼不测：人永远不知道鬼在想什么，故叫不测。占得不测，事情不吉利，却不明白为什么会这样。",
        "人魔戾相：人源源不断地滋生欲望戾气，事情刚开始表象吉利，中间还行，最后大凶，自毁之相。", 
        "人变异相：人下有变，异常之相，出现变化情况，吉凶要看变卦。行军遇此，速查内奸或准备改变方案。",
        "人妖极端：妖在人下，宠物生人之相，但是宠物怎么可能生出人来，是种极端思想，不切实际。此卦表象有利，实则不然，应该安守本分，不要多想。",
        "人天乱伦：人跑天之上去了，乱了伦理，本来就不科学不道德的事，却有人在想。行军遇此，正常手段不能成功，建议用美人计。",
        ///////////////////////
        "鬼地出尘：鬼在地上，破土而出，势不可挡也，意欲超越凡人之相。然非高人，比普通人强。遇事处于中等偏上。",
        "鬼神上位：鬼跑神之上了，这情况不可能存在，在相限中代表着不可能存在的可能。实际中可能是自己上位，如婚恋，也可能是别人上位，如功名官位。",
        "鬼人腐败：鬼在人心上，鬼心出人之相，人不人鬼不鬼，故称腐败。商人占得此卦大利，其他多大凶。",
        "鬼卦：人死魔灭，入土之中，生机消逝之相，代表生命终结。害怕之心为鬼，越害怕则鬼心越严重，其实不去想、不去念叨、不去讨论鬼，世界就清净了。",
        "鬼魔相互：表面上土木相克，但实际上木长在土中，土又养活了木。相互争斗又相互利用。合作占到相互，是好事；婚姻占相互是争吵一生；功名占相互，不利；打仗占相互，应该化敌为友。",
        "鬼变顺序：鬼在变化之上，是种要变化的均势，一定会变，时机问题，故言顺序，顺序而变。行军得此，顺道可行。打仗得此，时局大变，速换战略。占坟地大凶，必须迁坟。婚恋得此，对方变化，好坏不明。学业占此，完蛋。商人遇此，不吉利。",
        "鬼妖相向：鬼在妖之上，相向之相。鬼为人之灵，妖为动物类，鬼生妖，但鬼并不服妖，表面似从，内心不服。打仗占相向，似敌非敌，宜派说客。生意合作遇相向，谈不拢。恋爱得相向，拜拜。",
        "鬼天葬礼：人死升天之相。既可能是死之相，亦可能是升华之相。大吉也可大凶，大凶同样是大吉。打仗得此卦，全军覆没。考试得此卦，状元。",
        ///////////////////////
        "魔地横行：魔在地上乱窜，出笼无束之相，故横行无阻。魔地不吉之相，戾气满地，欲望涛天。黑社会或打仗得此卦，战无不胜。考试得此卦，名落孙山。商人得此卦多阻碍，白事商人例外。",
        "魔神渲染：渲染就是吹牛，魔在神上，欲望跑到神头上，是不实之相。演员、官员得此卦，大吉大利；其他涉及实事的完蛋。",
        "魔人大于：魔在人上，欲望在人头上，远远大于人了，故称大于。生病得大于，药攻破病。其他事情人控制不了局势，赔本受克。",
        "魔鬼生机：魔在鬼上，木在土中生长，是生机之意，大部分是吉相。若是占生病或坟地，则是危机。",
        "魔卦：魔在最上，魔性不能控制就会败却人性。魔性主欲望，魔卦是生机所生，魔是生存和发展的欲望，也是毁灭和占有的欲望。魔性可以为人所用，也可以毁灭人，如果将魔性用于善心善行，魔性也就无妨了。",
        "魔变通神：变在魔下，将要变化的欲望。欲望发生变化，转为空，故为通神。此卦凶中带吉，吉中带凶，吉凶在于人的把握。",
        "魔妖显著：妖在魔下，动物动了欲望，吃人害人之相。显著，是种明显的凶相，是为不吉。商人和考试占此卦吉利，其他基本大凶。",
        "魔天逆行：魔跑天上去了，欲望上天，不可行之，逆行是逆天不可行的意思。行军得此，有伏兵。考试得此，牛上天。恋爱得此，血本无归。商人得此，大赚。",
        ///////////////////////
        "变地明显：变化摆在地上，地上起火，路人皆知，明摆着的事，明显之相。工作占此，会有变化或变动。做生意得此，明显变好。恋爱占此，拜拜。打仗占此，双方必得硬拼。",
        "变神天昏：变在神之上，神发生了变化会难以分辨，天昏之相，整个世界混沌，一团乱套。生意、求财、升官最忌讳此卦，但故意捣乱的事情可成，如偷袭。",
        "变人远昭：变化在人之上，人火爆了就是出名的意思。思想变化了，声名远昭之相。此卦无关吉凶，无论好事坏事都一定声名远播。",
        "变鬼精华：鬼上有变化，鬼变受精，留日月精华，精华投胎之相。只有精华的鬼才可以变化。升官考试最喜此卦吉利。做生意得此，收缩破财。行军得此，建议轻装偷袭。相亲建议闪婚。普通工作占是裁员。",
        "变魔地暗：变化的魔性会让大地烧成灰烬。一片欲望，戾气满地，黑暗无比。正常事得此卦完蛋，干坏事得此卦大利。",
        "变卦：变卦为火，代表世界变化。变克妖，是指火可以驱离猛兽，人类用火是文明开端。人的变是指思想变化，人是有思想的智慧生物，故有能力改变，适应生存环境。",
        "变妖空虚：变化在妖之上，动物身上起火，烧毁灭绝，成空虚之相。考试恋爱得此完蛋。生病占此，立马就好。",
        "变天对相：变在天之上，整个世界都在变化。这卦针对的是相，而不是天，简称对相。考试遇此，半吉。相亲，不理解无果。行军，全军迂腐。生意，以守为佳。升官得此，吉凶难测。",
        ///////////////////////
        "妖地苦行：野兽满地跑，苦了行人，简称苦行。正常事不利，坏事捣乱可以。",
        "妖神通顺：妖在神之上，妖化神，进化之相。意思是指，动物有了神的思想，世界通顺。凡事得此，由坏转好，大吉之相。",
        "妖人恶心：恶心指恶人的心。野兽吃人，野兽在上，人在下，就是恶人拿人喂野兽的意思，这种恶人才是最可怕的。打仗占此，敌方太凶残。",
        "妖鬼惧行：妖在鬼上，野兽饿了要害人吃人，不可出行，故称俱行。正常事占此，完蛋。黑社会反而大吉。",
        "妖魔满地：妖在魔上，动物充满欲望要到处吃人，满地害人，故为凶相。打仗、恋爱、考试得此，完蛋。生意占此，大吉或大凶。",
        "妖变原始：动物在火上烤，都成烤肉了，当然回归原始，重新投胎。回归原点，重头再来之相。考试得此肯定重考。升官占此，明升暗降。生病占此，痊愈。恋爱占此，换一个重新来。打仗是退兵之相，准备不足。",
        "妖卦：魔性加重失去控制成妖，害人害世之心为妖，妖终结于变化，妖出就会变化。妖指的是无知动物、不开化生灵，而不是妖怪。知道妖是人性泯灭、害世害人之心，而去控制心性，保持理智，必有所得所会。",
        "妖天无礼：天上本来只有神仙，现在猪都上天了，当然对神仙无礼了。无礼，指事情都不正常了，不吉之相。",
        ///////////////////////
        "天地无情：风调雨顺和天灾地害都是自然变化，天地变化不会顺人心，只有人心顺应自然。所以人永远感觉天地无情。此卦无吉凶，道法自然。",
        "天神济世：神在天下，是为济世救人之相。神在天下行神识，破除魔之心性，导人向善。此卦行善大吉，做坏事完蛋。",
        "天人合一：天在上，人在下，人顺应天，天人混然一体有序之相。天人合一其实在说，人是天一部分，迟早要合为一体。",
        "天鬼乱治：鬼在天下，戾气横行，人心败坏，害人无数。鬼出土而乱世之相，代表着人治的混乱。此卦好的不灵，坏的灵。",
        "天魔解体：魔性欲望横行天下，魔主毁灭，分崩离析之相，故称解体。此卦不吉，分手、分家、离婚、散伙等等。",
        "天变幻生：天下有变，在天下变化之中人是不可能好的。幻生就是幻想的生机，想象中的美好生活，其实都是白日梦。婚恋、事业占此卦，半世浮云。",
        "天妖遂化：遂化是指快要变化了。妖在天下，横行无忌，当人受不了野兽横行的时候，就会站出来，因此世界开始变化。先凶后吉，吉凶转化，为变化之先机。此卦吉凶未可卜也。",
        "天卦：木火土金水五行加变化构成天，代表万物总决，一切的存在，包括所感所知皆属于天。世间万物变化源于天变，天变则在人心。万物在道之内，道在人心之内。"
        );
//十天干
 var TianGan = new Array("甲","乙","丙","丁","戊","己","庚","辛","壬","癸");
//十二地支
var DiZhi = new Array(
        "子",
        "丑",
        "寅",
        "卯",
        "辰",
        "巳",
        "午",
        "未",
        "申",
        "酉",
        "戌",
        "亥"    
        );
//十二地支五行
var DiZhiWuXing = new Array(
        "水",
        "土",
        "木",
        "木",
        "水",
        "火",
        "火",
        "土",
        "金",
        "金",
        "土",
        "水"    
        );
//对应十二天星
var TianXing = new Array(
        "玄武",
        "六合",
        "贵人",
        "青龙",
        "天后",
        "腾蛇",
        "朱雀",
        "太阴",
        "太常",
        "白虎",
        "勾陈",
        "天空"    
        );

//十二天星描述
var TianXingMiaoShu = new Array(
        "玄武：打架动武。",//0
        "六合：合作互惠。",//1
        "贵人：事业贵人。",//2
        "青龙：功名吉利。",//3
        "天后：女性领导。",//4
        "腾蛇：利益竞争。",//5
        "朱雀：口角争执。",//6
        "太阴：阴险女性。",//7
        "太常：正常之事。",//8
        "白虎：刀剑兵器。",//9
        "勾陈：心机谋略。",//10
        "天空：天时时机。" //11
        );
//十二个天星出动的描述
var TianXingChuDong = new Array(
        "玄武出关：争斗事情变化。",
        "六合出动：合作事情变化或动婚。",
        "贵人出关：事业变动，吉相。",   //后爻为水的时候，编一个贵人出游，
        "青龙出海：事业进步，吉相。",   //后爻为水的时候，青龙吸水
        "天后出宫：仪式之相，参与仪式或走形式。",
        "腾蛇出洞：利益斗争，不吉。",
        "朱雀出山：争吵变化。",
        "太阴出城：阴暗之事。",
        "太常出世：化为平淡。",
        "白虎出林：丧门星，伤亡之事。",
        "勾陈出斗：有变动或受伤。",
        "天空出实：天时之变。"
        );

//五行列表
var WuXing = new Array(
        "木",  //0
        "火",  //1
        "土",  //2
        "金",  //3
        "水"   //4
        );
//天时五行表，五进制，在没有破的情况下的计算，月日得到PK1，年与PK1得到PK2
var TianShiWuXingBuPo = new Array(
"木",	//"木木木"
"火",	//"木木火"
"木",	//"木木土"
"金",	//"木木金"
"木",	//"木木水"
"火",	//"木火木"
"火",	//"木火火"
"木",	//"木火土"
"火",	//"木火金"
"木",	//"木火水"
"木",	//"木土木"
"木",	//"木土火"
"木",	//"木土土"
"金",	//"木土金"
"木",	//"木土水"
"金",	//"木金木"
"火",	//"木金火"
"金",	//"木金土"
"金",	//"木金金"
"木",	//"木金水"
"木",	//"木水木"
"木",	//"木水火"
"木",	//"木水土"
"木",	//"木水金"
"木",	//"木水水"
"火",	//"火木木"
"火",	//"火木火"
"火",	//"火木土"
"火",	//"火木金"
"火",	//"火木水"
"火",	//"火火木"
"火",	//"火火火"
"土",	//"火火土"
"火",	//"火火金"
"水",	//"火火水"
"火",	//"火土木"
"土",	//"火土火"
"土",	//"火土土"
"火",	//"火土金"
"土",	//"火土水"
"火",	//"火金木"
"火",	//"火金火"
"火",	//"火金土"
"火",	//"火金金"
"水",	//"火金水"
"火",	//"火水木"
"水",	//"火水火"
"土",	//"火水土"
"水",	//"火水金"
"水",	//"火水水"
"木",	//"土木木"
"土",	//"土木火"
"木",	//"土木土"
"金",	//"土木金"
"木",	//"土木水"
"土",	//"土火木"
"土",	//"土火火"
"土",	//"土火土"
"土",	//"土火金"
"土",	//"土火水"
"木",	//"土土木"
"土",	//"土土火"
"土",	//"土土土"
"金",	//"土土金"
"土",	//"土土水"
"金",	//"土金木"
"土",	//"土金火"
"金",	//"土金土"
"金",	//"土金金"
"土",	//"土金水"
"木",	//"土水木"
"土",	//"土水火"
"土",	//"土水土"
"土",	//"土水金"
"土",	//"土水水"
"金",	//"金木木"
"火",	//"金木火"
"金",	//"金木土"
"金",	//"金木金"
"金",	//"金木水"
"火",	//"金火木"
"火",	//"金火火"
"金",	//"金火土"
"火",	//"金火金"
"水",	//"金火水"
"金",	//"金土木"
"金",	//"金土火"
"金",	//"金土土"
"金",	//"金土金"
"金",	//"金土水"
"金",	//"金金木"
"火",	//"金金火"
"金",	//"金金土"
"金",	//"金金金"
"水",	//"金金水"
"金",	//"金水木"
"水",	//"金水火"
"金",	//"金水土"
"水",	//"金水金"
"水",	//"金水水"
"木",	//"水木木"
"水",	//"水木火"
"木",	//"水木土"
"水",	//"水木金"
"木",	//"水木水"
"水",	//"水火木"
"水",	//"水火火"
"土",	//"水火土"
"水",	//"水火金"
"水",	//"水火水"
"木",	//"水土木"
"土",	//"水土火"
"土",	//"水土土"
"水",	//"水土金"
"土",	//"水土水"
"水",	//"水金木"
"水",	//"水金火"
"水",	//"水金土"
"水",	//"水金金"
"水",	//"水金水"
"木",	//"水水木"
"水",	//"水水火"
"土",	//"水水土"
"水",	//"水水金"
"水"	//"水水水"
);

//根据起卦的年月日地支获取天时
function GetTianShiByDiZhi(nianZhi, yueZhi, riZhi)
{
    //根据地支获取地支序号
    var idNianZhi = DiZhi.indexOf(nianZhi);
    var idYueZhi = DiZhi.indexOf(yueZhi);
    var idRiZhi = DiZhi.indexOf(riZhi);
    //地支转阴阳五行的天干
    var iNian = DZtoTGWX[idNianZhi];
    var iYue = DZtoTGWX[idYueZhi];
    var iRi = DZtoTGWX[idRiZhi];
    //判断如果月、日破，返回年
    if( IsWuXingPo(iYue, iRi) )
    {
        return TGanWX[iNian];
    };
    //如果年、日破，返回月
    if( IsWuXingPo(iNian, iRi) )
    {
        return TGanWX[iYue];
    };
    //如果年、月破，返回日
    if( IsWuXingPo(iNian, iYue) )
    {
        return TGanWX[iRi];
    }
    //都不破的情况下，月日得到PK1， PK1与年计算得PK2，返回PK2
    //根据没有破的三支五行确定天时
    return GetTianShiByBuPoWuXing(DiZhiWuXing[idNianZhi], DiZhiWuXing[idYueZhi], DiZhiWuXing[idRiZhi]  );
}
//根据地支的阴阳五行，选择对应的十天干
//"甲","乙","丙","丁","戊","己","庚","辛","壬","癸"
// 0,   1,   2,   3,   4,   5,  6,   7,   8,   9
var DZtoTGWX = new Array(
        8,//"子" 阳水
        5,//"丑" 阴土
        0,//"寅" 阳木
        1,//"卯" 阴木,
        8,//"辰" 阳水
        3,//"巳" 阴火
        2,//"午" 阳火
        5,//"未" 阴土
        6,//"申" 阳金
        7,//"酉" 阴金
        4,//"戌" 阳土
        9//"亥" 阴水   
);
var TGanWX = new Array(
        "木", "木",
        "火", "火",
        "土", "土",
        "金", "金",
        "水", "水"
        );
//隔4 或 隔 6 为破
function IsWuXingPo(i1, i2)
{
    var delta = Math.abs( i1 - i2 );
    if( (4 == delta) || (6 == delta) )
    {
        return 1;
    }
    else
    {
        return 0;
    }
}

//根据不破的五行获取天时
function GetTianShiByBuPoWuXing(nianWX, yueWX, riWX )
{
    var idNianWX = WuXing.indexOf(nianWX);
    var idYueWX = WuXing.indexOf(yueWX);
    var idRiWX = WuXing.indexOf(riWX);
    var ret =  TianShiWuXingBuPo[ idNianWX*25 + idYueWX*5 + idRiWX ];
    //返回
    return ret;
}

//五行配色
var ColorWuXing = new Array(
"green",    //木
"red",      //火
"#444444",  //土
"orange",     //金
"deepskyblue"  //水
);
//根据五行封装文本颜色
function PackWuXingColorText(text, wx)
{
    var idWX = WuXing.indexOf(wx);
    var clr = "black";  //如果查不到五行序号就用黑色
    if( (idWX >= 0) && (idWX <= 4 ))
    {
        clr = ColorWuXing[idWX];
    };
    //
    var strResult =  "<b><span style=\"color: " + clr + "\">";
    strResult += text;
    strResult += "</span></b>";
    return strResult;
};
//60甲子
var JiaZi  = new Array(
"甲子",
"乙丑",
"丙寅",
"丁卯",
"戊辰",
"己巳",
"庚午",
"辛未",
"壬申",
"癸酉",
"甲戌",
"乙亥",
"丙子",
"丁丑",
"戊寅",
"己卯",
"庚辰",
"辛巳",
"壬午",
"癸未",
"甲申",
"乙酉",
"丙戌",
"丁亥",
"戊子",
"己丑",
"庚寅",
"辛卯",
"壬辰",
"癸巳",
"甲午",
"乙未",
"丙申",
"丁酉",
"戊戌",
"己亥",
"庚子",
"辛丑",
"壬寅",
"癸卯",
"甲辰",
"乙巳",
"丙午",
"丁未",
"戊申",
"己酉",
"庚戌",
"辛亥",
"壬子",
"癸丑",
"甲寅",
"乙卯",
"丙辰",
"丁巳",
"戊午",
"己未",
"庚申",
"辛酉",
"壬戌",
"癸亥"
 );




